Revit 2027 API
RebarFreeFormAccessor.IsUnconstrained Method
 Returns true if the current rebar doesn't contains a valid server GUID, or contains a valid server GUID and no valid constraints.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsUnconstrained()
Public Function IsUnconstrained As Boolean
public:
bool IsUnconstrained()
member IsUnconstrained : unit -> bool
Return Value
Boolean
 Returns true if the current rebar doesn't contains a valid server GUID, or contains a valid server GUID and no valid constraints. Returns false if the current rebar contains a valid server GUID and has valid constraints.
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace